app/controllers/fixtures_controller.rb

  def index
    @fixtures = Fixture.page(params[:page]).all
---
SELECT "fixtures".* FROM "fixtures"

  def show
    @fixture = Fixture.find(params[:id])
---
SELECT "fixtures".* FROM "fixtures" WHERE "fixtures"."id" = ? LIMIT 1  [["id", "980190962"]]

  def edit
    @fixture = Fixture.find(params[:id])
---
SELECT "fixtures".* FROM "fixtures" WHERE "fixtures"."id" = ? LIMIT 1  [["id", "980190962"]]

  def create
    @fixture = Fixture.new(params[:fixture])

    respond_to do |format|
      if @fixture.save
---
INSERT INTO "fixtures" ("Court", "Division", "Team1", "Team2", "created_at", "date", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @fixture = Fixture.find(params[:id])
---
SELECT "fixtures".* FROM "fixtures" WHERE "fixtures"."id" = ? LIMIT 1  [["id", "980190962"]]

  def destroy
    @fixture = Fixture.find(params[:id])
    @fixture.destroy
---
SELECT "fixtures".* FROM "fixtures" WHERE "fixtures"."id" = ? LIMIT 1  [["id", "980190962"]]
DELETE FROM "fixtures" WHERE "fixtures"."id" = ?  [["id", 980190962]]