app/controllers/players_controller.rb

SELECT "players".* FROM "players"
---
  def index

    #if (params[:division] && !Division.find(params[:division][:id].to_i).empty?)
     # puts "Reached here"
      #@players = Player.where(:division_id=>params[:division][:id].to_i).order(sort_column + ' ' + sort_direction).page(params[:page])
    #else
     # puts "Reached Else"
     # @players = Player.order(sort_column + ' ' + sort_direction).page(params[:page])
    #end
    @hash= Hash.new

    if(params[:division] && params[:division][:id])

      if !Division.find_by_id(params[:division][:id].to_i).nil?
        @hash.merge!({:division_id=>params[:division][:id].to_i})
      end
    end
    if(params[:pooled])
       @hash.merge!(:pot_luck=>toboolean(params[:pooled]))
    end
    if(!params[:name].nil? && !params[:name].empty?)
      @hash.merge!(:first_name=>params[:name])
    end

    if(@hash.empty?)
      @players = Player.order(sort_column + ' ' + sort_direction).page(params[:page])

SELECT "players".* FROM "players" WHERE "players"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def show
    @player = Player.find(params[:id])

SELECT "players".* FROM "players" WHERE "players"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def edit
    @player = Player.find(params[:id])

INSERT INTO "players" ("created_at", "firstname", "lastname", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sat, 21 Apr 2012 14:43:30 UTC +00:00], ["firstname", "MyString"], ["lastname", "MyString"], ["updated_at", Sat, 21 Apr 2012 14:43:30 UTC +00:00]]
---
  def create
    @player = Player.new(params[:player])

    respond_to do |format|
      if @player.save

SELECT "players".* FROM "players" WHERE "players"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def update
    @player = Player.find(params[:id])

SELECT "players".* FROM "players" WHERE "players"."id" = ? LIMIT 1  [["id", "980190962"]]
DELETE FROM "players" WHERE "players"."id" = ?  [["id", 980190962]]
---
  def destroy
    @player = Player.find(params[:id])
    @player.destroy