app/controllers/results_controller.rb

  def index

    @results = Result.page(params[:page])
---
SELECT "results".* FROM "results"

  def show
    @result = Result.find(params[:id])
---
SELECT "results".* FROM "results" WHERE "results"."id" = ? LIMIT 1  [["id", "980190962"]]

  def edit
    @fixtures= Fixture.where(:date => (1.year.ago.to_date)..(Time.now.to_date)).order("date DESC")
    @result = Result.find(params[:id])
---
SELECT "results".* FROM "results" WHERE "results"."id" = ? LIMIT 1  [["id", "980190962"]]

  def update
    @result = Result.find(params[:id])
---
SELECT "results".* FROM "results" WHERE "results"."id" = ? LIMIT 1  [["id", "980190962"]]

  def destroy
    @result = Result.find(params[:id])
    @result.destroy
---
SELECT "results".* FROM "results" WHERE "results"."id" = ? LIMIT 1  [["id", "980190962"]]
DELETE FROM "results" WHERE "results"."id" = ?  [["id", 980190962]]