app/controllers/teams_controller.rb

  def index
    @teams = Team.page(params[:page]).all
---
SELECT "teams".* FROM "teams"

  def show
    @team = Team.find(params[:id])
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", "980190962"]]

  def edit
    @team = Team.find(params[:id])
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", "980190962"]]

  def create
    @team = Team.new(params[:team])

    respond_to do |format|
      if @team.save
---
INSERT INTO "teams" ("Playerone", "Playertwo", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["Playerone", 1], ["Playertwo", 1], ["created_at", Sat, 21 Apr 2012 14:43:30 UTC +00:00], ["updated_at", Sat, 21 Apr 2012 14:43:30 UTC +00:00]]

  def update
    @team = Team.find(params[:id])
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", "980190962"]]

  def destroy
    @team = Team.find(params[:id])
    @team.destroy
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", "980190962"]]
DELETE FROM "teams" WHERE "teams"."id" = ?  [["id", 980190962]]